src_doc/InformationRegisters/СтатусФоновыхЗаданийПроверкиПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусФоновыхЗаданийПроверкиПочты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяОбрабатываемаяУчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/СтатусФоновыхЗаданийПроверкиПочты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Записывает статус потока  
//
// Параметры: 
//  Поток  - Число
//  ДатаНачала  - Дата
//  ДатаПоследнейАктивности - Дата
//  ТекущаяОбрабатываемаяУчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись
//
Процедура ЗаписатьСтатус(Поток, ДатаНачала, ДатаПоследнейАктивности,
	ТекущаяОбрабатываемаяУчетнаяЗапись) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Поток = Поток;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Поток = Поток;
	Если ДатаНачала <> Неопределено Тогда
		МенеджерЗаписи.ДатаНачала = ДатаНачала;
	КонецЕсли;	
	МенеджерЗаписи.ДатаПоследнейАктивности = ДатаПоследнейАктивности;
	МенеджерЗаписи.ТекущаяОбрабатываемаяУчетнаяЗапись = ТекущаяОбрабатываемаяУчетнаяЗапись;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
